Before you turn this problem in, make sure everything runs as expected.

1. When connecting to the database, replace *yasiro01* or *username* with **your** username
1. Delete the `# YOUR CODE HERE` or `YOUR ANSWER HERE` line and replace it with your specific answer
1. Delete `raise NotImplementedError()`, if present
1. Include `%%sql` cell magic directive at the beginning of each cell with a SQL statement
1. **Restart the kernel** (in the menubar, select Kernel$\rightarrow$Restart)
1. **Run all cells** (in the menubar, select Cell$\rightarrow$Run All)
1. Add your name and collaborators below:

In [ ]:
NAME = ""
COLLABORATORS = ""

---

# Nested Queries and Set Operations

In [1]:
import warnings
warnings.filterwarnings('ignore')
from sols7 import *

In [2]:
%load_ext sql

In [3]:
%sql postgresql://manzhe01:@localhost/employees

### 1.  How many employees have never worked for the quality management department?

In [34]:
%%sql

select count(*)
from (
    (select emp_no from employees)
    except
    (select emp_no from employees natural join dept_emp natural join departments
    where dept_name = 'Quality Management')
    ) as foo
limit 10
;

 * postgresql://manzhe01:***@localhost/employees
1 rows affected.

[(279907,)]

In [35]:
test_subq1(_)

Correct!

You've got 2 out of 2 points.

### 2.  Give the first name, last name of the first 10 employees that have not been a Senior Engineer or Senior Staff. Order by employee number. "First" means by assigned employee number and not by hire date.

In [36]:
%%sql

select first_name, last_name
from (
    (select emp_no from employees)
    except
    (select emp_no from employees natural join titles
    where title = 'Senior Engineer' OR title = 'Senior Staff')
    ) as foo
natural join employees
order by emp_no
limit 10
;

 * postgresql://manzhe01:***@localhost/employees
10 rows affected.

[('Bezalel', 'Simmel'),
 ('Saniya', 'Kalloufi'),
 ('Duangkaew', 'Piveteau'),
 ('Mary', 'Sluis'),
 ('Berni', 'Genin'),
 ('Kazuhito', 'Cappelletti'),
 ('Lillian', 'Haddadi'),
 ('Mayuko', 'Warwick'),
 ('Ramzi', 'Erde'),
 ('Shahaf', 'Famili')]

In [37]:
test_subq2(_)

Correct!

You've got 2 out of 2 points.

### 3.  How many departments has each manager managed?

Your result should be in alphabetical order by last name, then first name

In [10]:
%%sql
select foo.first_name, foo.last_name, count(distinct dept_no)
from (select first_name, last_name, dept_no
      from dept_manager natural join employees) as foo
group by first_name, last_name
order by last_name

 * postgresql://manzhe01:***@localhost/employees
24 rows affected.

[('Ebru', 'Alpin', 1),
 ('Tonny', 'Butterworth', 1),
 ('Rosine', 'Cools', 1),
 ('Leon', 'DasSarma', 1),
 ('Oscar', 'Ghazalie', 1),
 ('Marjo', 'Giarratana', 1),
 ('DeForest', 'Hagimont', 1),
 ('Rutger', 'Hofmeyr', 1),
 ('Przemyslawa', 'Kaelbling', 1),
 ('Hilary', 'Kambil', 1),
 ('Shem', 'Kieras', 1),
 ('Isamu', 'Legleitner', 1),
 ('Margareta', 'Markovitch', 1),
 ('Vishwani', 'Minakawa', 1),
 ('Peternela', 'Onuegbe', 1),
 ('Shirish', 'Ossenbruggen', 1),
 ('Dung', 'Pesch', 1),
 ('Sanjoy', 'Quadeer', 1),
 ('Karsten', 'Sigstam', 1),
 ('Xiaobin', 'Spinelli', 1),
 ('Arie', 'Staelin', 1),
 ('Yuchang', 'Weedman', 1),
 ('Krassimir', 'Wegerle', 1),
 ('Hauke', 'Zhang', 1)]

In [11]:
test_subq3(_)

Correct!

You've got 2 out of 2 points.

### 4.  How many people were ever managed by Tonny Butterworth? Consider all the cases.

In [25]:
%%sql

select count(*)
from (
    select dept_no, from_date, to_date
    from dept_manager natural join employees
    where first_name = 'Tonny' and last_name = 'Butterworth'
) dmbt join dept_emp on dmbt.dept_no = dept_emp.dept_no
where (dept_emp.from_date <= dmbt.from_date and dept_emp.to_date >= dmbt.from_date) or 
    (dept_emp.from_date <= dmbt.to_date and dept_emp.to_date >= dmbt.to_date) or
    (dept_emp.from_date <= dmbt.from_date and dept_emp.to_date >= dmbt.to_date) or
    (dept_emp.from_date >= dmbt.from_date and dept_emp.to_date <= dmbt.to_date)

 * postgresql://manzhe01:***@localhost/employees
1 rows affected.

[(4453,)]

In [26]:
test_subq4(_)

Correct!

You've got 2 out of 2 points.

### 5.  How many people have not ever been a manager?

In [38]:
%%sql

select count(*)
from (
    select emp_no from employees
    except
    select emp_no
    from dept_manager) as notmanage
;

 * postgresql://manzhe01:***@localhost/employees
1 rows affected.

[(300000,)]

In [39]:
test_subq5(_)

Correct!

You've got 2 out of 2 points.

### 6.  What is the average salary for the 1980's?  What is the average salary for the 1990's?

Lets define this as salary level that start and end in the same decade.  We will leave out any salaries that cross the decade boundary.

Format the salaries using '$999,999.99'.

Your final answer should have two columns and two rows.  The columns should be labeled decade and average.

In [41]:
%%sql

select '1980' as decade, to_char(avg(salary), '$999,999.99') as average
from salaries
where from_date >= '1981-01-01' and to_date <= '1989-12-31'
union
select '1990' as decade, to_char(avg(salary), '$999,999.99') as average
from salaries
where from_date >= '1990-01-01' and to_date <= '1999-12-31'
;

 * postgresql://manzhe01:***@localhost/employees
2 rows affected.

[('1980', '$  54,985.51'), ('1990', '$  62,281.51')]

In [42]:
test_subq6(_)

Correct!

You've got 2 out of 2 points.

### 7.  How many people have had 5 or more raises since May 5, 1979?

In [43]:
%%sql

select count(*)
from (
    select emp_no, count(*) as numraises
    from salaries
    where from_date >= '1979-05-05'
    group by emp_no) as raises
where numraises >= 5
;

 * postgresql://manzhe01:***@localhost/employees
1 rows affected.

[(245432,)]

In [44]:
test_subq7(_)

Correct!

You've got 2 out of 2 points.

### 8. Select the first and last names of the first 10 employees ordered by last name, first name that have never worked for the development department.

In [45]:
%%sql

select first_name, last_name
from (
    (select emp_no
    from employees)
    except
    (select emp_no
    from dept_emp natural join departments
    where dept_name = 'Development')) as foo
natural join employees
order by last_name, first_name
limit 10
;

 * postgresql://manzhe01:***@localhost/employees
10 rows affected.

[('Aemilian', 'Aamodt'),
 ('Aleksander', 'Aamodt'),
 ('Alexius', 'Aamodt'),
 ('Alois', 'Aamodt'),
 ('Amabile', 'Aamodt'),
 ('Anestis', 'Aamodt'),
 ('Anwar', 'Aamodt'),
 ('Arlette', 'Aamodt'),
 ('Arumugam', 'Aamodt'),
 ('Arunachalam', 'Aamodt')]

In [46]:
test_subq8(_)

Correct!

You've got 2 out of 2 points.

### 9.What is the largest salary of any of the employees who are not currently in management?

In [50]:
%%sql
select to_char(max(salary), '$999,999.99')
from(select salary
    from departments natural join dept_emp join salaries on dept_emp.emp_no=salaries.emp_no
    where dept_name!='Management' and dept_emp.to_date>now()) as foo

 * postgresql://manzhe01:***@localhost/employees
1 rows affected.

[('$ 158,220.00',)]

In [32]:
test_subq9(_)

Correct!

You've got 2 out of 2 points.

### 10. What current managers make less than the highest paid non-management employee?

In [51]:
%%sql

select dept_manager.emp_no, first_name, last_name, salary
from salaries join employees on salaries.emp_no = employees.emp_no join dept_manager on dept_manager.emp_no = salaries.emp_no
where salary < (
    select max(salary)
    from (
        (select emp_no from dept_emp)
    except (select emp_no from dept_manager)
    ) as highsal
natural join salaries
order by max DESC
limit 1)
and now() < salaries.to_date
and now() < dept_manager.to_date
;

 * postgresql://manzhe01:***@localhost/employees
9 rows affected.

[(110039, 'Vishwani', 'Minakawa', 106491),
 (110114, 'Isamu', 'Legleitner', 83457),
 (110228, 'Karsten', 'Sigstam', 65400),
 (110420, 'Oscar', 'Ghazalie', 56654),
 (110567, 'Leon', 'DasSarma', 74510),
 (110854, 'Dung', 'Pesch', 72876),
 (111133, 'Hauke', 'Zhang', 101987),
 (111534, 'Hilary', 'Kambil', 79393),
 (111939, 'Yuchang', 'Weedman', 58745)]

In [52]:
test_subq10(_)

Correct!

You've got 2 out of 2 points.